{"keras_version": "2.2.2", "class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_3", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 22], "sparse": false, "dtype": "float32", "name": "input_3"}}, {"name": "embedding_1", "class_name": "Embedding", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"name": "embedding_1", "batch_input_shape": [null, null], "dtype": "float32", "input_length": null, "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "embeddings_constraint": null, "output_dim": 512, "trainable": true, "input_dim": 1003, "activity_regularizer": null, "mask_zero": true}}, {"name": "input_2", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 2048], "sparse": false, "dtype": "float32", "name": "input_2"}}, {"name": "bidirectional_1", "class_name": "Bidirectional", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"name": "bidirectional_1", "layer": {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "implementation": 1, "return_sequences": true, "kernel_regularizer": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "name": "CaptionFeature", "unroll": false, "recurrent_constraint": null, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "trainable": true, "bias_constraint": null, "unit_forget_bias": true, "dropout": 0.0, "activity_regularizer": null, "go_backwards": false}}, "merge_mode": "concat", "trainable": true}}, {"name": "ImageFeature", "class_name": "Dense", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"name": "ImageFeature", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"name": "bidirectional_2", "class_name": "Bidirectional", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"name": "bidirectional_2", "layer": {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "implementation": 1, "return_sequences": false, "kernel_regularizer": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "name": "CaptionFeature2", "unroll": false, "recurrent_constraint": null, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "trainable": true, "bias_constraint": null, "unit_forget_bias": true, "dropout": 0.0, "activity_regularizer": null, "go_backwards": false}}, "merge_mode": "concat", "trainable": true}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["ImageFeature", 0, 0, {}]]], "config": {"name": "dropout_1", "seed": null, "rate": 0.5, "trainable": true, "noise_shape": null}}, {"name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["bidirectional_2", 0, 0, {}], ["dropout_1", 0, 0, {}]]], "config": {"name": "concatenate_1", "trainable": true, "axis": -1}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"name": "dropout_2", "seed": null, "rate": 0.5, "trainable": true, "noise_shape": null}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "softmax", "units": 1003, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "backend": "tensorflow"}