{"class_name": "Model", "config": {"name": "model_3", "output_layers": [["dense_3", 0, 0]], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 22], "name": "input_3", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "input_dim": 998, "activity_regularizer": null, "dtype": "float32", "embeddings_constraint": null, "input_length": 22, "batch_input_shape": [null, 22], "embeddings_regularizer": null, "trainable": true, "mask_zero": true, "output_dim": 512}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2048], "name": "input_2", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "CaptionFeature", "bias_constraint": null, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "go_backwards": false, "dropout": 0.0, "kernel_regularizer": null, "recurrent_constraint": null, "unroll": false, "trainable": true, "bias_regularizer": null, "return_sequences": true, "stateful": false, "return_state": false, "implementation": 1, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "units": 256, "recurrent_regularizer": null, "kernel_constraint": null}}, "merge_mode": "concat"}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "ImageFeature", "class_name": "Dense", "config": {"name": "ImageFeature", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "units": 512, "trainable": true, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "bidirectional_2", "class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "CaptionFeature2", "bias_constraint": null, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "go_backwards": false, "dropout": 0.0, "kernel_regularizer": null, "recurrent_constraint": null, "unroll": false, "trainable": true, "bias_regularizer": null, "return_sequences": true, "stateful": false, "return_state": false, "implementation": 1, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "units": 256, "recurrent_regularizer": null, "kernel_constraint": null}}, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["ImageFeature", 0, 0, {}]]]}, {"name": "time_distributed_1", "class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "units": 256, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null}}}, "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]]}, {"name": "repeat_vector_1", "class_name": "RepeatVector", "config": {"name": "repeat_vector_1", "trainable": true, "n": 22}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}], ["repeat_vector_1", 0, 0, {}]]]}, {"name": "lstm_1", "class_name": "LSTM", "config": {"name": "lstm_1", "bias_constraint": null, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "go_backwards": false, "dropout": 0.0, "kernel_regularizer": null, "recurrent_constraint": null, "unroll": false, "trainable": true, "bias_regularizer": null, "return_sequences": false, "stateful": false, "return_state": false, "implementation": 1, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "units": 256, "recurrent_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "units": 512, "trainable": true, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "units": 998, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}]}, "keras_version": "2.2.2", "backend": "tensorflow"}