{"keras_version": "2.2.2", "backend": "tensorflow", "config": {"name": "model_3", "output_layers": [["dense_2", 0, 0]], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "layers": [{"name": "input_3", "config": {"name": "input_3", "sparse": false, "batch_input_shape": [null, 22], "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "embedding_1", "config": {"mask_zero": true, "embeddings_constraint": null, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "dtype": "float32", "name": "embedding_1", "batch_input_shape": [null, 22], "output_dim": 512, "activity_regularizer": null, "trainable": true, "embeddings_regularizer": null, "input_length": 22, "input_dim": 1006}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Embedding"}, {"name": "CaptionFeature", "config": {"recurrent_dropout": 0.0, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "name": "CaptionFeature", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "return_state": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": true, "go_backwards": false, "dropout": 0.0, "unit_forget_bias": true, "stateful": false, "kernel_regularizer": null, "bias_regularizer": null, "activation": "tanh", "kernel_constraint": null, "implementation": 1, "use_bias": true, "recurrent_constraint": null, "bias_constraint": null, "units": 256}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "input_2", "config": {"name": "input_2", "sparse": false, "batch_input_shape": [null, 2048], "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "CaptionFeature1", "config": {"recurrent_dropout": 0.0, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "name": "CaptionFeature1", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "return_state": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": false, "go_backwards": false, "dropout": 0.0, "unit_forget_bias": true, "stateful": false, "kernel_regularizer": null, "bias_regularizer": null, "activation": "tanh", "kernel_constraint": null, "implementation": 1, "use_bias": true, "recurrent_constraint": null, "bias_constraint": null, "units": 256}, "inbound_nodes": [[["CaptionFeature", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "ImageFeature", "config": {"activation": "relu", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "bias_regularizer": null, "name": "ImageFeature", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 512}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["CaptionFeature1", 0, 0, {}], ["ImageFeature", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "dense_1", "config": {"activation": "relu", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 512}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_2", "config": {"noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true, "rate": 0.5}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_2", "config": {"activation": "softmax", "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 1006}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense"}]}, "class_name": "Model"}